Revit 2026 API

# City Class

---

An object that contains geographical location information for a known city.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCity

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class City : APIObject
```
```vb
Public Class City
	Inherits APIObject
```
```cpp
public ref class City : public APIObject
```
```fsharp
type City =
    class
        inherit APIObject
    end
```

The City type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Latitude | Latitude of the city |
|  | Longitude | Longitude of the city |
|  | Name | The name of the city |
|  | TimeZone | Time-zone in which the city resides |
|  | WeatherStation | An identifier for the nearest weather station |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This object contains longitude, latitude, time zone information for a city already known by Revit. Currently Revit does not the ability to add cities to the existing list. The list of known cities can be retrieved using the Cities property on the application object.

#### Reference

Autodesk.Revit.DB Namespace